app/controllers/admins_backoffice/publications_controller.rb

SELECT "publications".* FROM "publications"
---
  def index
    @publications = Publication.all.page(params[:page]).per(4)

SELECT "publications".* FROM "publications" WHERE "publications"."admin_id" = $1  [["admin_id", 2]]
---
  def my_publics
    @publications = Publication.where(admin_id: current_admin.id).page(params[:page]).per(4)

INSERT INTO "publications" ("admin_id", "subject_id", "title", "description", "image", "reference_link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @publication = Publication.new(params_publication)
      if @publication.save

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_publication
    @publication = Publication.find(params[:id])

SELECT "subjects"."description", "subjects"."id" FROM "subjects"
---
  def set_subject
    @subject = Subject.all.pluck(:description, :id)