app/controllers/admins_backoffice/subjects_controller.rb

    def index
      @subjects = Subject.all.order(:description).page(params[:page])
---
SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

    def create
      @subject = Subject.new(params_subject)
      if params[:subject][:description].blank?
        render :new
      else
        @subject.save
---
INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Enem"], ["created_at", "2023-01-25 22:18:40.731294"], ["updated_at", "2023-01-25 22:18:40.731294"]]