app/controllers/admins_backoffice/welcome_controller.rb

SELECT "publications".* FROM "publications"
---
  def index
    @publications = Publication.all.page(params[:page]).per(4)

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @publication = Publication.find(params[:id])